#ifndef     __EPC_IO_LIB_H__
#define     __EPC_IO_LIB_H__

//IO公共操作接口

BOOL  LoadEpcIoLibrary();

/*********************************************************************************************************
** 函数名称：epcIoRead(DWORD *dwPinState)
** 功能描述：读取GPIO口的状态，此函数只读取GPIO中为输入的引脚的电平状态
** 入口参数：dwPinState 指向GPI口状态的指针，即用它返回GPI口的状态
** 返回值  ：>0:成功
**			 =0:错误
** 说明：	 GPI0对应Bit0,GPI1对应Bit1
**           GPI引脚编号:	0	1	2	3	4	5	6	7	...	 
**			 PinState的位:	0	1	2	3	4	5	6	7	...		 
********************************************************************************************************/
int epcIoRead(DWORD *dwPinState);

/*********************************************************************************************************
** 函数名称：epcIoWrite(DWORD dwPinState)
** 功能描述：写GPIO，此函数将dwPinState的值写到GPIO中为输出的引脚上
** 入口参数：dwPinState 要输出的数据，即为输出的GPIO口值
** 返回值  ：>0:成功
**			 =0:错误
** 说明：	 GPO0对应Bit0,GPO1对应Bit1
**           GPO引脚编号:	0	1	2	3	4	5	6	7	...	 
**			 dwPinState的位:0	1	2	3	4	5	6	7	...		 
********************************************************************************************************/
int epcIoWrite(DWORD dwPinState);


#endif