#ifndef __PUBLIC_FILEMAPPING_H
#define __PUBLIC_FILEMAPPING_H



//
//=============================================================================
// 进程间通信定义的文件映射
//  目前用于键盘小程序与主程序之间的消息传递, 比如传递当前输入状态, 当前光标位置
//
//                  DSM800APPINFO共享映射内存
//  =============       =============       =============
//  |           |       | inputMode |       |           |
//  | kbaux进程 | <---> | caretPos  | <---> |主程序进程 |
//  |           |       | ...       |       |           |
//  =============       =============       =============
//
//=============================================================================
//
#define DSM800_APPINFOEXCHG_MAPPING     L"DSM800APPINFO"    // 内存映射文件名

//
//-----------------------------------------------------------------------------
// 输入法模式
//-----------------------------------------------------------------------------
//
enum APP_KBInputMode
{
    APP_KB_MODE_NUM,                            // 数字输入模式
    APP_KB_MODE_LET,                            // 字母输入模式
    APP_KB_MODE_UNDEF = -1
};

//
//-----------------------------------------------------------------------------
// 内存映射文件DSM800APPINFO保存的结构
//-----------------------------------------------------------------------------
//
struct DSM800AppInfo
{
    APP_KBInputMode         inputMode;          // 当前输入模式, kbapp==>inputMode, inputMode==>主程序
    POINT                   caretPos;           // 当前光标位置(相对于光标所在窗口), kbapp==>主程序==>caretPos==>kbapp
};



#endif  // __PUBLIC_FILEMAPPING_H



