#pragma once


#include "../ListBoxEL/ListBoxEL.h"


//
//=============================================================================
// CListBox3dLine    3D的边线与分割线的列表扩展, 比如用于设置页面的左边菜单导航
//=============================================================================
//
#define LBT_3L_TEXTLFHEIGHT         -15                                 // 推荐字体大小, 需要外层应用调用SetFont
#define LBT_3L_ITEMHEIGHT           40                                  // 推荐行高, 需要外层应用在SetFont后再设置
#define LBT_3L_3DBORDER_SIZE        2                                   // 3D边框宽度
#define LBT_3L_3DSEPARATOR_SIZE     2                                   // 3D行分割线宽度


#define LBT_3L_BKCOLOR              RGB(171, 210, 245)                  // 背景颜色
#define LBT_3L_HLCOLOR              RGB(239, 145, 16)                   // 高亮颜色
#define LBT_3L_LLCOLOR              RGB(157, 160, 168)                  // 低亮颜色

#define LBT_3L_TEXTCOLOR            RGB(40,  50,  68)                   // 文字颜色
#define LBT_3L_HLTEXTCOLOR          RGB(255, 255, 255)                  // 高亮文本颜色

#define LBT_3L_3DBORDER1_COLOR      RGB(0, 0, 0)                        // 3D边框颜色1
#define LBT_3L_3DBORDER2_COLOR      RGB(0x31, 0x38, 0x42)               // 3D边框颜色2
#define LBT_3L_3DSEPARATOR1_COLOR   RGB(0, 0, 0)                        // 3D行分割线颜色1
#define LBT_3L_3DSEPARATOR2_COLOR   RGB(0x44, 0x5D, 0x77)               // 3D行分割线颜色2
#define LBT_3L_SELECTTAG_COLOR      RGB(0x6A, 0x9F, 0xD0)               // 当前行箭头标记颜色



//
//-----------------------------------------------------------------------------
// CListBox3dLine
//
//  CListBoxEL的扩展, 拥有3D的边线与分割线
//-----------------------------------------------------------------------------
//
class CListBoxT_3dLine: public CListBoxEL
{
public:
    //
    //=============================================================================
    // 控件创建及样式
    //=============================================================================
    //
    CListBoxT_3dLine ();
    virtual ~CListBoxT_3dLine ();

    void  PostInitTemplateStyle ();

protected:
    //
    //=============================================================================
    // 消息处理
    //=============================================================================
    //
    virtual void  PaintNC (CDC* pDC);
    virtual void  DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct);


protected:
    //
    //=============================================================================
    // 辅助
    //=============================================================================
    //

protected:
    //
    //=============================================================================
    // 内部状态属性变量
    //=============================================================================
    //

};


//
//=============================================================================
// CListBoxT_FlatBorder    平面带边框的效果, 比如用于导航菜单的popup列表
//=============================================================================
//
#define LBT_FB_BORDER_SIZE          2                                   // 边框宽度

#define LBT_FB_BORDERCOLOR          RGB(224, 229, 235)                  // 边框颜色, 我自己改的颜色

#define LBT_FB_BKCOLOR              RGB(171, 210, 245)                  // 背景颜色
#define LBT_FB_HLCOLOR              RGB(239, 145, 16)                   // 高亮颜色
#define LBT_FB_LLCOLOR              RGB(157, 160, 168)                  // 低亮颜色

#define LBT_FB_TEXTCOLOR            RGB(40,  50,  68)                   // 文字颜色
#define LBT_FB_HLTEXTCOLOR          RGB(255, 255, 255)                  // 高亮文本颜色

#define LBT_FB2_BKCOLOR             RGB(67, 66, 81)                     // 背景颜色2号方案

//
//-----------------------------------------------------------------------------
// CListBoxT_FlatBorder
//
//  平面带边框的效果
//-----------------------------------------------------------------------------
//
class CListBoxT_FlatBorder: public CListBoxEL
{
public:
    //
    //=============================================================================
    // 控件创建及样式
    //=============================================================================
    //
    CListBoxT_FlatBorder ();
    virtual ~CListBoxT_FlatBorder ();

    void  PostInitTemplateStyle ();

protected:
    //
    //=============================================================================
    // 消息处理
    //=============================================================================
    //
    virtual void  PaintNC (CDC* pDC);
    virtual void  DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct);


protected:
    //
    //=============================================================================
    // 辅助
    //=============================================================================
    //

protected:
    //
    //=============================================================================
    // 内部状态属性变量
    //=============================================================================
    //

};

