#ifndef _TEST_MACRO_H_
#define _TEST_MACRO_H_

///< 以指定精度测试浮点数相等宏
#define AST_F_EX(v1, v2, prt) ASSERT_NEAR(v1, v2, prt) \
    <<"----------------------------------------------------------------------" \
    "---------"                                                          

#define EPT_F_EX(v1, v2, prt) EXPECT_NEAR(v1, v2, prt) \
    <<"----------------------------------------------------------------------" \
    "---------"                                                                

///< 以精度为0.01测试浮点数相等宏
#define AST_F(v1, v2) ASSERT_NEAR(v1, v2, 0.01) \
    <<"----------------------------------------------------------------------" \
    "---------"                                                          

#define EPT_F(v1, v2) EXPECT_NEAR(v1, v2, 0.01) \
    <<"----------------------------------------------------------------------" \
    "---------"                                                                

///< 测试SCCalc::Vector数据相等宏，向量的模精度为0.001，角度精度为0.001
#define AST_V(v1, vmd, vdg) \
{\
    AST_F_EX(v1.md, vmd, 0.001);\
    AST_F_EX(v1.dg, vdg, 0.001);\
}

#define EPT_V(v1, vmd, vdg) \
{\
    EPT_F_EX(v1.md, vmd, 0.001);\
    EPT_F_EX(v1.dg, vdg, 0.001);\
}

#endif